---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisGlazingIsShaded
source: html/8ea2a9f9-901b-4e72-d2fb-d2022d4d88c6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.EnergyAnalysisGlazingIsShaded Property

"Glazing is Shaded"

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get; }
```